INSERT INTO place_types(id, title)
VALUES
    (1, 'транспортный объект')
;

INSERT INTO place_types(id, title, parent_id, system_name)
VALUES
    (2, 'аэропорт', 1, 'airport'),
    (3, 'вокзал', 1, 'railway_station'),
    (4, 'автовокзал', 1, 'bus_terminal'),
    (5, 'порт', 1, 'port'),
    (6, 'терминал', 2, 'airport_terminal'),
    (7, 'речной вокзал', 1, 'riverside_station')
;

SELECT setval('place_types_id_seq', (SELECT MAX(id) FROM place_types LIMIT 1));

INSERT INTO places(id, parent_id, title, type_id)
VALUES
    (1, NULL, 'Внуково', 2),
    (2, 1, 'A', 6),
    (3, 1, 'B', 6),
    (4, 1, 'D', 6),
    (5, NULL, 'Домодедово', 2),
    (6, NULL, 'Шереметьево', 2),
    (7, 6, 'B', 6),
    (8, 6, 'C', 6),
    (9, 6, 'D', 6),
    (10, 6, 'E', 6),
    (11, 6, 'F', 6),
    (12, NULL, 'Остафьево', 2),
    (13, NULL, 'Раменское', 2),
    (14, NULL, 'Чкаловский', 2),
    (15, NULL, 'Пулково', 2),
    (16, 15, '1', 6),
    (17, 15, '2', 6),
    (18, 15, 'новый', 6)
;

SELECT setval('places_id_seq', (SELECT MAX(id) FROM places LIMIT 1));

INSERT INTO places(title, type_id)
VALUES
    ('Балтийский', 3),
    ('Витебский', 3),
    ('Ладожский', 3),
    ('Московский', 3),
    ('Финляндский', 3),
    ('Белорусский', 3),
    ('Казанский', 3),
    ('Киевский', 3),
    ('Курский', 3),
    ('Ленинградский', 3),
    ('Павелецкий', 3),
    ('Рижский', 3),
    ('Савеловский', 3),
    ('Ярославский', 3),
    ('Щелковский', 4),
    ('Павелецкий', 4),
    ('Морской', 5),
    ('Пролетарский', 7),
    ('Уткина заводь', 7)
;

UPDATE places p
SET full_title = p.title || ' ' || pt.title
FROM place_types pt
WHERE pt.id = p.type_id;

-- Формируем полный заголовок
UPDATE places p
SET full_title = tmp.title
FROM (
    WITH RECURSIVE required_places(id, title) AS (
        SELECT DISTINCT pw.id, pw.title || ' ' || pwt.title
        FROM places pw
        INNER JOIN place_types pwt
            ON pwt.id = pw.type_id
        WHERE pw.parent_id IS NULL
        UNION ALL
        SELECT pwr.id, pw.title || ', ' || pwr.title || ' ' || pwt.title
        FROM places pwr
        INNER JOIN required_places pw
            ON pw.id = pwr.parent_id
        INNER JOIN place_types pwt
            ON pwt.id = pwr.type_id
    )
    SELECT * FROM required_places
) tmp
WHERE tmp.id = p.id;

-- Определяем наличие дочерних записей
UPDATE places
SET have_children = TRUE
WHERE id IN (SELECT DISTINCT parent_id FROM places);

INSERT INTO address_object_levels (id, title, code)
VALUES
    (1, 'Регион', 'region'),
    (2, 'Округ', 'area'),
    (3, 'Район округа', 'area_district'),
    (4, 'Город', 'city'),
    (5, 'Район города', 'city_district'),
    (6, 'Населенный пункт', 'settlement'),
    (7, 'Улица', 'street'),
    (90, 'Дополнительная территория', 'territory'),
    (91, 'Часть дополнительной территории', 'sub_territory'),
    (0, 'Здание', 'building')
;

INSERT INTO regions (number, title)
VALUES
    ('01', 'Адыгея Респ'),
    ('02', 'Башкортостан Респ'),
    ('03', 'Бурятия Респ'),
    ('04', 'Алтай Респ'),
    ('05', 'Дагестан Респ'),
    ('06', 'Ингушетия Респ'),
    ('07', 'Кабардино-Балкарская Респ'),
    ('08', 'Калмыкия Респ'),
    ('09', 'Карачаево-Черкесская Респ'),
    ('10', 'Карелия Респ'),
    ('11', 'Коми Респ'),
    ('12', 'Марий Эл Респ'),
    ('13', 'Мордовия Респ'),
    ('14', 'Саха /Якутия/ Респ'),
    ('15', 'Северная Осетия - Алания Респ'),
    ('16', 'Татарстан Респ'),
    ('17', 'Тыва Респ'),
    ('18', 'Удмуртская Респ'),
    ('19', 'Хакасия Респ'),
    ('20', 'Чеченская Респ'),
    ('21', 'Чувашская Республика - Чувашия'),
    ('22', 'Алтайский край'),
    ('23', 'Краснодарский край'),
    ('24', 'Красноярский край'),
    ('25', 'Приморский край'),
    ('26', 'Ставропольский край'),
    ('27', 'Хабаровский край'),
    ('28', 'Амурская обл'),
    ('29', 'Архангельская обл'),
    ('30', 'Астраханская обл'),
    ('31', 'Белгородская обл'),
    ('32', 'Брянская обл'),
    ('33', 'Владимирская обл'),
    ('34', 'Волгоградская обл'),
    ('35', 'Вологодская обл'),
    ('36', 'Воронежская обл'),
    ('37', 'Ивановская обл'),
    ('38', 'Иркутская обл'),
    ('39', 'Калининградская обл'),
    ('40', 'Калужская обл'),
    ('41', 'Камчатский край'),
    ('42', 'Кемеровская обл'),
    ('43', 'Кировская обл'),
    ('44', 'Костромская обл'),
    ('45', 'Курганская обл'),
    ('46', 'Курская обл'),
    ('47', 'Ленинградская обл'),
    ('48', 'Липецкая обл'),
    ('49', 'Магаданская обл'),
    ('50', 'Московская обл'),
    ('51', 'Мурманская обл'),
    ('52', 'Нижегородская обл'),
    ('53', 'Новгородская обл'),
    ('54', 'Новосибирская обл'),
    ('55', 'Омская обл'),
    ('56', 'Оренбургская обл'),
    ('57', 'Орловская обл'),
    ('58', 'Пензенская обл'),
    ('59', 'Пермский край'),
    ('60', 'Псковская обл'),
    ('61', 'Ростовская обл'),
    ('62', 'Рязанская обл'),
    ('63', 'Самарская обл'),
    ('64', 'Саратовская обл'),
    ('65', 'Сахалинская обл'),
    ('66', 'Свердловская обл'),
    ('67', 'Смоленская обл'),
    ('68', 'Тамбовская обл'),
    ('69', 'Тверская обл'),
    ('70', 'Томская обл'),
    ('71', 'Тульская обл'),
    ('72', 'Тюменская обл'),
    ('73', 'Ульяновская обл'),
    ('74', 'Челябинская обл'),
    ('75', 'Забайкальский край'),
    ('76', 'Ярославская обл'),
    ('77', 'Москва г'),
    ('78', 'Санкт-Петербург г'),
    ('79', 'Еврейская Аобл'),
    ('80', 'Забайкальский край Агинский Бурятский округ'),
    ('81', 'Коми-Пермяцкий АО'),
    ('82', 'Корякский АО'),
    ('83', 'Ненецкий АО'),
    ('84', 'Таймырский (Долгано-Ненецкий) АО'),
    ('85', 'Иркутская обл Усть-Ордынский Бурятский округ'),
    ('86', 'Ханты-Мансийский Автономный округ - Югра АО'),
    ('87', 'Чукотский АО'),
    ('88', 'Эвенкийский АО'),
    ('89', 'Ямало-Ненецкий АО'),
    ('91', 'Крым Респ'),
    ('92', 'Севастополь г'),
    ('99', 'Байконур г')
;
