INSERT INTO address_objects (id, address_id, parent_id, level, full_title, title, prefix, house_count, postal_code, address_level, region, next_address_level)
VALUES
    ('29251dcf-00a1-4e34-98d4-5c47484a36d4', '29251dcf-00a1-4e34-98d4-5c47484a36d4', NULL, '0', 'г Москва', 'Москва', 'г', '0', NULL, 1, 77, 7),
    ('77303f7c-452b-4e73-b2b0-cbc59fe636c2', '77303f7c-452b-4e73-b2b0-cbc59fe636c2', '29251dcf-00a1-4e34-98d4-5c47484a36d4', '1', 'г Москва, ул Стахановская', 'Стахановская', 'ул', '4', 123456, 7, 77, NULL),
    ('77303f7c-452b-4e73-b2b0-cbc59fe636c4', '77303f7c-452b-4e73-b2b0-cbc59fe636c4', '29251dcf-00a1-4e34-98d4-5c47484a36d4', '1', 'г Москва, пр Ставропольский', 'Ставропольский', 'пр', '0', NULL, 7, 77, NULL),
    ('77303f7c-452b-4e73-b2b0-cbc59fe636c5', '77303f7c-452b-4e73-b2b0-cbc59fe636c5', '29251dcf-00a1-4e34-98d4-5c47484a36d4', '1', 'г Москва, пл Сталина', 'Сталина', 'пл', '0', NULL, 7, 77, NULL),
    ('77303f7c-452b-4e73-b2b0-cbc59fe636c6', '77303f7c-452b-4e73-b2b0-cbc59fe636c6', '29251dcf-00a1-4e34-98d4-5c47484a36d4', '1', 'г Москва, ал Старших Бобров', 'Старших Бобров', 'ал', '0', 123456, 7, 77, NULL),
    ('77303f7c-452b-4e73-b2b0-cbc59fe636c7', '77303f7c-452b-4e73-b2b0-cbc59fe636c7', '29251dcf-00a1-4e34-98d4-5c47484a36d4', '1', 'г Москва, ул Машинная', 'Машинная', 'ул', '0', NULL, 7, 77, NULL),
    ('77303f7c-452b-4e73-b2b0-cbc59fe636c8', '77303f7c-452b-4e73-b2b0-cbc59fe636c8', '77303f7c-452b-4e73-b2b0-cbc59fe636d0', '2', 'г Москва, р-н Мытищинский, ул Стахановская',  'Стахановская', 'ул', '0', 1234567, 7, 77, NULL),
    ('77303f7c-452b-4e73-b2b0-cbc59fe636c9', '77303f7c-452b-4e73-b2b0-cbc59fe636c9', '77303f7c-452b-4e73-b2b0-cbc59fe636d0', '2', 'г Москва, р-н Мытищинский, ул Раздолбайская', 'Раздолбайская', 'ул', '0', 1234567, 7, 77, NULL),
    ('77303f7c-452b-4e73-b2b0-cbc59fe636d0', '77303f7c-452b-4e73-b2b0-cbc59fe636d0', '29251dcf-00a1-4e34-98d4-5c47484a36d4', '1', 'г Москва, р-н Мытищинский',  'Мытищинский', 'р-н', '0', NULL, 7, 77, NULL)
;

INSERT INTO houses(full_number, id, house_id, address_id, postal_code)
VALUES
    ('16с17', '841254dc-0074-41fe-99ba-0c8501526c04', '841254dc-0074-41fe-99ba-0c8501526c04', '77303f7c-452b-4e73-b2b0-cbc59fe636c2', 654321),
    ('16с18', '841254dc-0074-41fe-99ba-0c8501526c05', '841254dc-0074-41fe-99ba-0c8501526c05', '77303f7c-452b-4e73-b2b0-cbc59fe636c2', NULL),
    ('23', '841254dc-0074-41fe-99ba-0c8501526c06', '841254dc-0074-41fe-99ba-0c8501526c06',    '77303f7c-452b-4e73-b2b0-cbc59fe636c2', NULL),
    ('1к1', '841254dc-0074-41fe-99ba-0c8501526c07', '841254dc-0074-41fe-99ba-0c8501526c07',   '77303f7c-452b-4e73-b2b0-cbc59fe636c2', NULL)
;
